In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame()

In [4]:
print df

Empty DataFrame
Columns: []
Index: []

In [5]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16],[17,18,19,20]])

In [6]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [7]:
df1.head()

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [9]:
df1.head(2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [10]:
df1.tail(2)

    0   1   2   3
3  13  14  15  16
4  17  18  19  20